
&НаКлиенте
Процедура СписокЗаказаЦенаПланПриИзменении(Элемент)
	РасчетСуммы()
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказаКоличествоПриИзменении(Элемент)
	РасчетСуммы()
КонецПроцедуры

&НаКлиенте   
Процедура РасчетСуммы()
	элТабл= Элементы.СписокЗаказа.ТекущиеДанные;
	элТабл.СуммаПлан = элТабл.Количество*элТабл.ЦенаПлан;
	
КонецПроцедуры // РасчетСуммы()
 	



//&НаКлиенте
//Процедура ТоварыНоменклатураПриИзменении(Элемент)
//	СтрокаЭл=Элементы.Товары.ТекущиеДанные;
//	СтрокаЭл.Цена = ПолучитьЦену (СтрокаЭл.Номенклатура);
//	ТоварыЦенаПриИзменении(Элемент); //пересчитать сумму
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьЦену (НоменклатураИзДокумента)
//	СтруктураПоиска = Новый Структура ();
//	СтруктураПоиска.Вставить("Номенклатура",НоменклатураИзДокумента);
//	СтруктураПоиска.Вставить("Контрагент",Объект.Контрагент);
//	СтруктураПоиска.Вставить("Договор",Объект.Договор);
//	
//	РезультатПоиска = РегистрыСведений.ЦеныПоставщиков.Получить(СтруктураПоиска);
//	
//	Возврат РезультатПоиска.Цена;

//	//ЦенаТовара = Регистры сведений.Товара.Цена;
//	//Возврат  РезультатФункцииСумма;
//КонецФункции
