	
Функция ИсточникОплатыПриИзмененииНаСервере(ИсточникОплаты)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсточникХраненияДС.Владелец КАК Владелец,
		|	РН_МестаНакопленияДенегОстатки.СуммаОстаток
		|ИЗ
		|	Справочник.ИсточникХраненияДС КАК ИсточникХраненияДС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РН_МестаНакопленияДенег.Остатки КАК РН_МестаНакопленияДенегОстатки
		|		ПО РН_МестаНакопленияДенегОстатки.МестоХраненияДС = ИсточникХраненияДС.Ссылка
		|ГДЕ
		|	ИсточникХраненияДС.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ИсточникОплаты);
	РЗ = Запрос.Выполнить();
	ВЗ = РЗ.Выбрать();
	ВЗ.Следующий(); 
	СтруктЗапроса = Новый Структура("Плательщик,ОстатокИсточникаОплаты",ВЗ.Владелец,ВЗ.СуммаОстаток); 
	Возврат   СтруктЗапроса;
КонецФункции


Функция ЗаполнениеДопСвойствНоменклатуры(Стр) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ценность,
		|	Номенклатура.ЦельПлатежа,
		|	Номенклатура.ГруппаНоменклатуры,
		|	Номенклатура.ОбъектПлатежа,
		|	Номенклатура.ОснЕдИзмерения,
		|	Номенклатура.ЕдИзмСравнения,
		|	Номенклатура.КолВоСравнения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Стр.Номенклатура);
	
	РЗ = Запрос.Выполнить();
	
	ВЗ = РЗ.Выбрать();
	ВЗ.Следующий(); 
	ЗаполнитьЗначенияСвойств(Стр,ВЗ);
	Возврат   Стр;
КонецФункции  