
&НаКлиенте
Процедура СписокЗаказаЦенаПриИзменении(Элемент)
	ПодсчетСуммы()
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказаКоличествоПриИзменении(Элемент)
	ПодсчетСуммы()
КонецПроцедуры

&НаКлиенте
Процедура ПодсчетСуммы()
	 ЭлТаб=Элементы.СписокЗаказа.ТекущиеДанные;
	 ЭлТаб.Сумма=ЭлТаб.Цена* ЭлТаб.Количество;
 КонецПроцедуры      // ПодсчетСуммы()

&НаКлиенте
Процедура СписокЗаказаНоменклатураПриИзменении(Элемент)
	Тел = Элементы.СписокЗаказа.ТекущиеДанные;
	Тел.Склад  = Объект.ОснМестоСклад;

	//ЭлТаб.Цена = ПолучениеЦены(ЭлТаб.Номенклатура);//, Объект.Контрагент);
	ПодсчетСуммы();
	УстановкаВидимостиЭлементовСписокЗаказа_ПРОБЕГ(ВозвратГруппыНоменклатуры(Тел.Номенклатура));
	
	СтрНом = Новый Структура("Номенклатура,Ценность,ЦельПлатежа,ГруппаНоменклатуры,ОбъектПлатежа,КолВоСравнения,ЕдИзмСравнения,ОснЕдИзмерения");
	СтрНом.Номенклатура  =  Тел.Номенклатура;
	ОбращБД.ЗаполнениеДопСвойствНоменклатуры(СтрНом);
	ЗаполнитьЗначенияСвойств(Тел,СтрНом);
	
	//Фокус на форме
	
 КонецПроцедуры

&НаСервереБезКонтекста
Функция ВозвратГруппыНоменклатуры(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Родитель
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РЗ = Запрос.Выполнить();
	ВЗ = РЗ.Выбрать();
	ВЗ.Следующий(); 
	Возврат   ВЗ.Родитель;
КонецФункции 

&НаКлиенте
Процедура СписокЗаказаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	//Тел = Элементы.СписокЗаказа.ТекущиеДанные;
	//		
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказаСуммаПриИзменении(Элемент)
	Тел = Элементы.СписокЗаказа.ТекущиеДанные;
	Если Тел.Количество>0 Тогда
		Тел.Цена = Тел.Сумма/Тел.Количество	;
	Иначе
		Тел.Количество = Тел.Сумма/Тел.Цена	;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.СписокЗаказаПробег.Видимость = Ложь;
	УстановкаВидимостиЭлементовСписокЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура УстановкаВидимостиЭлементовСписокЗаказа()
	Если  ЭтаФорма.Параметры.Ключ.Пустая() Тогда
	КонецЕсли; 	
	
	Если Объект.ЕстьГСМ Тогда
		Элементы.СписокЗаказаПробег.Видимость = Истина;
	Иначе
		Элементы.СписокЗаказаПробег.Видимость = ЛОЖЬ;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура УстановкаВидимостиЭлементовСписокЗаказа_ПРОБЕГ(ГруппаНоменкл)
	Если ГруппаНоменкл = Справочники.Номенклатура.НайтиПоНаименованию("ГСМ",Истина) Тогда
		Объект.ЕстьГСМ = Истина;
		Элементы.СписокЗаказаПробег.Видимость = Истина;
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ИсточникОплатыПриИзменении(Элемент)
	СтруктЗапроса =  ОбращБД.ИсточникОплатыПриИзмененииНаСервере(Объект.ИсточникОплаты);
	ЗаполнитьЗначенияСвойств(Объект,СтруктЗапроса);
	
	//Объект.Плательщик = СтруктЗапроса.
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьТоварПоСкидке(Команда)
	ПересчитатьСкидку();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСкидку()
	//ТЧ.Объект
КонецПроцедуры


&НаКлиенте
Процедура СкидкаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СписокЗаказаНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.КонтрагентМесто") Тогда
		СтандартнаяОбработка = Ложь;
		ПарамФормы = новый Структура("Отбор",Новый структура("Район",Объект.РайонПокупки));
		ОпиасниеОпов = Новый ОписаниеОповещения("ПослеЗакрытияВыборкаКонтрагента",ЭтотОбъект);
		ОткрытьФорму("Справочник.КонтрагентМесто.ФормаВыбора",ПарамФормы,ЭтаФорма,,,,ОпиасниеОпов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗакрытияВыборкаКонтрагента(ПараметрыВыбора,Параметры) Экспорт
	 ОБъект.Контрагент = ПараметрыВыбора;
КонецПроцедуры

