
&НаКлиенте
Процедура МатериальныеЦенностиГруппаНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораСправНоменклатураГрупп");
КонецПроцедуры


&НаКлиенте
Процедура МатериальныеЦенностиГруппаНоменклатурыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура МатериальныеЦенностиГруппаНоменклатурыОткрытие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура МатериальныеЦенностиНоменклатураНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура МатериальныеЦенностиНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОжь;
	ОписаФормы = Новый ОписаниеОповещения("ПослеЗакрытияФормы",ЭтаФорма);
	ПарамФормы = Новый Структура("Ссылка",Элементы.МатериальныеЦенности.ТекущиеДанные.ГруппаНоменклатуры);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораЭлементаСОтбором",ПарамФормы,ЭтаФорма,,,,ОписаФормы);
КонецПроцедуры

&НаКлиенте
Процедура   ПослеЗакрытияФормы(ПараметрыВыбора,ИсточникВыбора) Экспорт
	Элементы.МатериальныеЦенности.ТекущиеДанные.Номенклатура= ПараметрыВыбора;
	Элементы.МатериальныеЦенности.ТекущийЭлемент = Элементы.МатериальныеЦенностиМестоСклад;
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЦенностиНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЦенностиКоличествоПриИзменении(Элемент)
	Тел = Элементы.МатериальныеЦенности.ТекущиеДанные;  
	ОМ_Клиент.ВозвратСуммы(Тел);
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЦенностиЦенаПриИзменении(Элемент)
	//Тел = Элементы.МатериальныеЦенности.ТекущиеДанные;  
	ОМ_Клиент.ВозвратСуммы(Элементы.МатериальныеЦенности.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЦенностиСуммаПриИзменении(Элемент)
	Тел = Элементы.МатериальныеЦенности.ТекущиеДанные;  
	Тел.Цена = Тел.Сумма / Тел.Количество;
КонецПроцедуры
