
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.РН_МестаНакопленияДенег.Записывать = Истина;
	Движение = Движения.РН_МестаНакопленияДенег.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.МестоХраненияДС = ИсточникДС_Получатель;
	//Движение.Пользователь = Отправитель;
	Движение.ОтКогоКомуКуда = Получатель;
	Движение.Сумма = Сумма;
	Движение.Основание = Основание;

	// регистр РН_МестаНакопленияДенег Расход
	Движения.РН_МестаНакопленияДенег.Записывать = Истина;
	Движение = Движения.РН_МестаНакопленияДенег.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.МестоХраненияДС = ИсточникДС_Отправитель;
	//Движение.Пользователь = Отправитель;
	Движение.ОтКогоКомуКуда = Получатель;
	Движение.Сумма = Сумма;
	Движение.Основание = Основание;
КонецПроцедуры
