
&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	СозадниеТЧСЗапроса();
КонецПроцедуры

&НаСервере
Процедура СозадниеТЧСЗапроса()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_Остатки_ДС_ПоВидуНакопленияСрезПоследних.ВидИсточникаЗраненияДС КАК ВидИсточникаЗраненияДС,
		|	РС_Остатки_ДС_ПоВидуНакопленияСрезПоследних.Период КАК Период,
		|	РС_Остатки_ДС_ПоВидуНакопленияСрезПоследних.СуммаОстаток КАК СуммаОстаток,
		|	РС_Остатки_ДС_ПоВидуНакопленияСрезПоследних.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТОстатки
		|ИЗ
		|	РегистрСведений.РС_Остатки_ДС_ПоВидуНакопления.СрезПоследних КАК РС_Остатки_ДС_ПоВидуНакопленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОстатки.ВидИсточникаЗраненияДС КАК МестоХраненияДС,
		|	ВТОстатки.Период КАК Дата,
		|	РН_МестаНакопленияДенегОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
		|	РН_МестаНакопленияДенегОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
		|	РН_МестаНакопленияДенегОстаткиИОбороты.СуммаОборот КАК СуммаОборот,
		|	РН_МестаНакопленияДенегОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
		|	ВТОстатки.СуммаОстаток КАК ВНаличии,
		|	ВТОстатки.Регистратор КАК СсылкаНаДокумент,
		|	РН_МестаНакопленияДенегОстаткиИОбороты.СуммаКонечныйОстаток - ВТОстатки.СуммаОстаток КАК Баланс
		|ИЗ
		|	ВТОстатки КАК ВТОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РН_МестаНакопленияДенег.ОстаткиИОбороты КАК РН_МестаНакопленияДенегОстаткиИОбороты
		|		ПО ВТОстатки.ВидИсточникаЗраненияДС.Ссылка = РН_МестаНакопленияДенегОстаткиИОбороты.МестоХраненияДС.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТОстатки.ВидИсточникаЗраненияДС.Владелец";

	РЗ = Запрос.Выполнить();
	ТЗ = РЗ.Выгрузить();
	Объект.ТЧБаланс.Загрузить(ТЗ); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ТЧБалансВНаличииПриИзменении(Элемент)
	Тел = Элементы.ТЧБаланс.ТекущиеДанные; 
	Тел.Баланс =  Тел.СуммаКонечныйОстаток - Тел.ВНаличии;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Период.ДатаНачала = НачалоДня(ТекущаяДата());
	Период.ДатаОкончания = КонецДня(ТекущаяДата());
	ПередачаПараметровДС();
КонецПроцедуры

&НаКлиенте
Процедура ПередачаПараметровДС()
	ОМ_ДС.ПередПарам_ДС(РасходыЗаПериод,Период.ДатаНачала,"ДатаНач");
	ОМ_ДС.ПередПарам_ДС(РасходыЗаПериод,Период.ДатаОкончания,"ДатаКон");
КонецПроцедуры 

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПередачаПараметровДС();
КонецПроцедуры
