
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Номенклатура") Тогда
	//	// Заполнение шапки
	//	ГруппаНоменклатуры = ДанныеЗаполнения.Родитель.ГруппаНоменклатуры;
	//	ОбъектПлатежа = ДанныеЗаполнения.Родитель.ОбъектПлатежа;
	//	ОснЕдИзмерения = ДанныеЗаполнения.Родитель.ОснЕдИзмерения;
	//	ЕдИзмСравнения = ДанныеЗаполнения.Родитель.ОснЕдИзмерения;
	//	ЦельПлатежа = ДанныеЗаполнения.Родитель.ЦельПлатежа;
	//	Ценность = ДанныеЗаполнения.Родитель.Ценность;
	//КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
