
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьИсточникиХраненияДС ();
	Объект.ОбщаяСумма = Объект.ВводОстатковДС.Итог("Сумма");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсточникиХраненияДС()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсточникХраненияДС.Ссылка КАК МестоХраненияДС
	|ИЗ
	|	Справочник.ИсточникХраненияДС КАК ИсточникХраненияДС
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ИсточникХраненияДС.СрокДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИсточникХраненияДС.СрокДействия > &ТекДаты
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ИсточникХраненияДС.Активна = ИСТИНА";
	
	Запрос.УстановитьПараметр("ТекДаты", ТекущаяДата());
	
	РЗ = Запрос.Выполнить();
	ТЗ = РЗ.Выгрузить();
	
	Объект.ВводОстатковДС.Загрузить(ТЗ);
КонецПроцедуры 