

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.РС_Остатки_ДС_ПоВидуНакопления.Записывать = Истина;
	Для Каждого ТекСтрокаВводОстатковДС Из ВводОстатковДС Цикл
		Движение = Движения.РС_Остатки_ДС_ПоВидуНакопления.Добавить();
		Движение.Период = Дата;
		Движение.ВидИсточникаЗраненияДС = ТекСтрокаВводОстатковДС.МестоХраненияДС;
		Движение.СуммаОстаток = ТекСтрокаВводОстатковДС.Сумма;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ОбщаяСумма = ВводОстатковДС.Итог("Сумма");
КонецПроцедуры
