
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = СписокЗатрат.Итог("Сумма")-Скидка;
	//	ОбщаяСумма =
	//"ВЫБРАТЬ
	//|	СУММА(Покупка.СуммаДокумента) КАК СуммаДокумента
	//|ИЗ
	//|	Документ.Покупка КАК Покупка"	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	РайонПокупки = Справочники.Районы.НайтиПоНаименованию("Октябрьский");	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заявка") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДокументОснования = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаСписокЗаказа Из ДанныеЗаполнения.СписокЗаказа Цикл
			НоваяСтрока = СписокЗатрат.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСписокЗаказа.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаСписокЗаказа.Номенклатура;
			НоваяСтрока.Сумма = ТекСтрокаСписокЗаказа.СуммаПлан;
			НоваяСтрока.Цена = ТекСтрокаСписокЗаказа.ЦенаПлан;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЦеныМагазинов
	Движения.ЦеныМагазинов.Записывать = Истина;
	Для Каждого ТекСтр Из СписокЗатрат Цикл
		Если НЕ ТекСтр.ЕдИзмСравнения.Пустая() И (ТипЗнч(Контрагент) = Тип("СправочникСсылка.КонтрагентМесто")
			И НЕ ТекСтр.КолВоСравнения = 0 или
			ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты")) Тогда
			Движение = Движения.ЦеныМагазинов.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтр.Номенклатура;
			Движение.Контрагент = Контрагент;
			Движение.ГруппаНоменклатуры = ТекСтр.ГруппаНоменклатуры;
			Движение.Цена = ТекСтр.Цена;
			Движение.ЦенаСравнения = ТекСтр.Цена/ТекСтр.КолВоСравнения;
			Движение.ЕдИзмСравнения = ТекСтр.ЕдИзмСравнения;
			Движение.ОснЕдИзмерения = ТекСтр.ОснЕдИзмерения;
		КонецЕсли;
	КонецЦикла;
	
	// регистр Затраты 
	Движения.Затраты.Записывать = Истина;
	Для Каждого ТекСтр Из СписокЗатрат Цикл
		Движение = Движения.Затраты.Добавить();
		
		Движение.Период = Дата;
		Движение.Ценность = ТекСтр.Ценность;
		Движение.Номенклатура = ТекСтр.Номенклатура;
		Движение.Контрагент = Контрагент;
		Движение.ОбъектПлатежа = ТекСтр.ОбъектПлатежа;
		
		Движение.ГруппаНоменклатуры = ТекСтр.ГруппаНоменклатуры;
		Движение.ЦельПлатежа = ТекСтр.ЦельПлатежа;
		Движение.КолВоСравнения = ТекСтр.КолВоСравнения;
		Движение.Количество = ТекСтр.Количество;
		Движение.Сумма = ТекСтр.Сумма;
		Движение.ОснЕдИзмерения = ТекСтр.ОснЕдИзмерения;
		Движение.ЕдИзмСравнения = ТекСтр.ЕдИзмСравнения;
		
	КонецЦикла;
	
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

