
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ПолныйАдрес");

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Данные.ПолныйАдрес) Тогда
		Представление = Данные.Наименование + " (" + Данные.ПолныйАдрес+")";	
	Иначе 
		Представление = Данные.Наименование;	
	КонецЕсли;	
КонецПроцедуры
