
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаМатериальныеЦенности Из МатериальныеЦенности Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаМатериальныеЦенности.Номенклатура;
		Движение.Склад = ТекСтрокаМатериальныеЦенности.МестоСклад;
		Движение.Количество = ТекСтрокаМатериальныеЦенности.Количество;
		Движение.Сумма = ТекСтрокаМатериальныеЦенности.Сумма;
	КонецЦикла;
КонецПроцедуры
