
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ЗаполнитьЗначенияСвойств(Объект,Объект.Родитель);

	Если  НЕ ЗначениеЗаполнено(Объект.ОснЕдИзмерения ) Тогда
		Объект.ОснЕдИзмерения = ПодставитьЕдинИзмерения();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПодставитьЕдинИзмерения()
	ЕдПоУмолч = Справочники.ЕденицаИзмерения.НайтиПоНаименованию("шт.");
	Возврат ЕдПоУмолч;
КонецФункции

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	Если Объект.ЕдИзмСравнения = ПредопределенноеЗначение("Справочник.ЕденицаИзмерения.Килограмм") Тогда 
		Если  Объект.КолВоСравнения < 1 Тогда
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения*1000) + " гр."+ " ";
		Иначе
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения) + " кг."+ " ";
		КонецЕсли;
	ИначеЕсли  Объект.ЕдИзмСравнения = ПредопределенноеЗначение("Справочник.ЕденицаИзмерения.Литр") Тогда //л.
		Если  Объект.КолВоСравнения < 1 Тогда
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения*1000) + " мг."+ " ";
		Иначе
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения) + " л."+ " ";
		КонецЕсли;
	КонецЕсли;
	
	Объект.Наименование = ""+ Номенклатура + " " + Объект.ФирмаПроизводитель + ФорматСравнения;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ГруппаНоменклатуры = Объект.Родитель.ГруппаНоменклатуры;
		Объект.ОбъектПлатежа = Объект.Родитель.ОбъектПлатежа;
		Объект.ОснЕдИзмерения = Объект.Родитель.ОснЕдИзмерения;
		Объект.ЕдИзмСравнения = Объект.Родитель.ОснЕдИзмерения;
		Объект.ЦельПлатежа = Объект.Родитель.ЦельПлатежа;
		Объект.Ценность = Объект.Родитель.Ценность;
	КонецЕсли;
//ЗаполнитьЗначенияСвойств(Объект,Объект.Родитель);
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если Объект.ЕдИзмСравнения = ПредопределенноеЗначение("Справочник.ЕденицаИзмерения.Килограмм") Тогда 
		Если  Объект.КолВоСравнения < 1 Тогда
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения*1000) + " гр."+ " ";
		Иначе
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения) + " кг."+ " ";
		КонецЕсли;
	ИначеЕсли  Объект.ЕдИзмСравнения = ПредопределенноеЗначение("Справочник.ЕденицаИзмерения.Литр") Тогда //л.
		Если  Объект.КолВоСравнения < 1 Тогда
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения*1000) + " мг."+ " ";
		Иначе
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения) + " л."+ " ";
		КонецЕсли;
	КонецЕсли;
	
	Объект.ПолноеНаименование = ""+ Объект.Наименование + " " + Объект.ФирмаПроизводитель + ФорматСравнения;
КонецПроцедуры
